* Insect Laser Fence

** Abstract

The purpose of this repository is to organize resources for
implementation of a laser fence that targets insects, including the
mosquito and spotted lanternfly. A research question is to determine
if work done on laser fences that target mosquitos in Africa could be
adapted to spotted lanternfly in Pennsylvania. Note that the original
mosquito use case was popularized in 2010 and described as a failure
in 2016 (Schiller, 2016).

** Target Characterizations
*** Mosquito

| Characteristic           | Value                | Source     |
|--------------------------+----------------------+------------|
| Average Flying Altitude  | 2 meters             | Kare, 2010 |
| Supply                   | ∞                    | Kare, 2010 |
| Size                     | < 2 centimeters      | Kare, 2010 |
| Speed                    | < 1 meter per second | Kare, 2010 |
| Lethal Energy Dose Req'd | > 50 mJ in 3 ms      | Kare, 2010 |

*** Spotted Lanternfly

"As early as July, adults can be seen, and they mate and lay eggs from
late September through the onset of winter." (Wikipedia 2020)
Therefore, a system that target adults should be placed into service
from July through the onset of winter.

| Characteristic          | Value               | Source                       |
|-------------------------+---------------------+------------------------------|
| Average Flying Altitude | TODO                |                              |
| Supply                  | "killem killem all" | https://youtu.be/1g82I7w3ENU |
| Size                    | TODO                |                              |
| Speed                   | TODO                |                              |

TODO - Translate size to requirements for identification

TODO - Translate speed to requirements for response time

** Chosen Design

Currently working on the Laser Turret solution.

*** Bill of Materials

- [[https://www.nvidia.com/en-us/autonomous-machines/embedded-systems/jetson-nano/][NVIDIA Jetson Nano]] :: Master control system and image processing for
     target identification. [[https://www.microcenter.com/product/620641/nvidia-jetson-nano-developer-kit---rev-2][$99.00 at Micro Center]]
- [[http://www.meccano.com/product/778988618080/meccano---super-construction-set][Erector by Meccano - Super Construction Set]] :: Turret assembly and
     component positioning. [[https://www.amazon.com/Meccano-Construction-Motorized-Building-Education/dp/B07C4ZWC1F/ref=sr_1_2?dchild=1&keywords=meccano&qid=1593880029&sr=8-2&th=1][$199.00 (v1) at Amazon]]
- [[https://www.sparkfun.com/products/retired/15430][Leopard Imaging 145 FOV Camera]] :: Note that this camera has been
     discontinued. It was originally included in the older [[https://learn.sparkfun.com/tutorials/assembly-guide-for-sparkfun-jetbot-ai-kit][SparkFun
     JetBot AI Kit]].
- [[https://www.sparkfun.com/products/15449][Edimax 2-in-1 WiFi and Bluetooth 4.0 Adapter]] :: Connectivity to the
     NVIDIA Jetson Nano. [[https://www.sparkfun.com/products/15449][$19.95 at SparkFun]].
- Laser :: TODO
- Galvo :: TODO
- Power :: TODO
- Cabinet :: TODO waterproofing enclosure with windows for sensors and
             lasers. The enclosure could have a mask/shutter to
             prevent firing beams ouside of the desired area. Note
             that many lasers may have temperature limits beyond
             typical ambient summer temperature in the target area of
             operations.

| Component                                    |  Price |
|----------------------------------------------+--------|
| NVIDIA Jetson Nano                           |  99.00 |
| Edimax 2-in-1 WiFi and Bluetooth 4.0 Adapter |  19.95 |
|----------------------------------------------+--------|
| Total                                        | 118.95 |
#+TBLFM: $2=vsum(@2..@-1)

*** Software System

- [[https://developer.nvidia.com/embedded/jetpack][NVIDIA JetPack SDK]]
- [[https://www.python.org/][Python]]
- [[https://opencv.org/][OpenCV]]

*** Open Choices
**** Platform Options

- Fixed Platform :: Camera and laser are fixed in place; lasers are
  aimed using galvos.
- Moving Platform :: Camera and laser are mounted to a vehicle; lasers
  are aimed by driving the vehicle using servo motors.

**** Camera Options

***** Single Camera

Callibrate laser beam angles to video positions.

This suffers from parallax error. Kare mentions this but doesn't
address it. There are solutions to create depth maps using a single
camera ([[https://ieeexplore.ieee.org/document/4160954][MonoSLAM]], [[https://vision.in.tum.de/research/vslam/lsdslam][LSD-SLAM]]), but they require a moving camera in a
static environment. We could estimate depth based on camera focus if
we could get that information from the camera and it was able to focus
on the insect, but this is not likely.

One option is to accept that we don't have depth, and the insect could
be anywhere from the nearest point the camera can see to its farthest
point, and straffe the laser from one to the other. The drawback is
that this is more laser energy that will strike the background.

***** Stereoscopic Vision

Use two cameras to locate objects in real world coordinates
([[https://docs.opencv.org/4.2.0/dd/d53/tutorial_py_depthmap.html][ref]]).

This doesn't look precise enough to find the depth of an
insect.

*** Milestones [1/6]

1. [X] Jetson Nano environment setup
2. [ ] Raspberry pi environment setup
3. [ ] Detect a target in a single frame
   1. [ ] spotted lanternfly
   2. [ ] mosquito
4. [ ] Track a target through multiple frames
   1. [ ] spotted lanternfly
   2. [ ] mosquito
5. [ ] Test laser functions using a low powered test laser
   1. [ ] Can engage / disengage test laser
   2. [ ] Can steer beam on target
   3. [ ] Can limit beam to bounding box
   4. [ ] Can coordinate multiple lasers
6. [ ] Equip the kill laser and engage live targets
   1. [ ] spotted lanternfly
   2. [ ] mosquito

** Camera Selection

*** Features

- Interface :: Data interface between camera and computer. Prefer the
  fastest interface available. Kare remarked that USB may be too slow.
- Night Vision :: Usually cameras with night vision include infrared
  LEDs and detect infrared wavelengths. At night these cameras produce
  black and white images.
- IR-cutoff :: Switches between day and night modes. Generally
  improves both day and night image quality but may cut back and forth
  at dawn and dusk.
- Distortion :: Fisheye lenses have high visual distortion. This will
  make it more difficult to map pixels to real world positions.
- Case / Mount :: A weather proof protective case would be a
  plus. Also we want a case that can be securely mounted to the
  platform. This matters because we'll need to recalibrate every time
  the camera shifts.
- Resolution :: Prefer higher resolution, since we're looking for bugs
  and bugs are small.
- Refresh Rate :: Prefer 60 fps or more, which is widely available.
- Focus :: Manual or autofocus.

*** Product Categories

- Single board computer components :: There are several cameras made
  for single board computers, such as Raspberry Pi and Jetson Nano.
  These connect to the board with a CSI port. Many provide night
  vision. Some have fisheye lenses. Most of these do not come with a
  case and may be difficult to mount. Most are manual focus.
- Security cams :: These are CCTV cameras. Many are USB; some use an
  analog cable. Most include night vision and IR LEDs with
  IR-cutoff. These usually come in a weather proof cases and would be
  easy to mount securely. Most are manual focus.
- Webcam :: These are usually USB. These come with a plastic
  case. Usually these can be mounted easily but aren't weather
  proof. Some of these support night vision. Most are autofocus.

** Laser Selection
*** Laser Safety
**** Eye-safe / Infrared

Eye-safe lasers can still damage eyes, but the damage is done to the
cornea and will heal. Lasers that aren't eye-safe cause damage to the
retina which is permanent. Eye-safe lasers have wavelengths longer
than 1400 nm.

IR Lasers are lasers with wavelengths in the infrared band (700 nm to
1 mm). These pose greater risk to eyes because since they aren't
visible, they don't trigger the blink reflex, so eyes are more likely
to be exposed for longer and sustain more damage.

Unfortunately all Eye-safe lasers are also IR. We should get laser
safety goggles and use them whenever lasers are active.

Some links, will clean up later:
- https://en.wikipedia.org/wiki/Laser_safety
- https://www.rp-photonics.com/eye_safe_lasers.html
- https://seminex.com/lasers-and-eye-safety.aspx/

**** Fire Safety

High powered lasers can pose a fire risk.

When we get the kill laser, we will need to test it with dry leaves in
a controlled environment to determine how much power is required to
cause ignition.

**** Bounding Box

We have to prevent the system from sending beams into the sky or
neighbors' yards/houses. There should be software constraints but
ideally also a physical shield should block the path of the laser.

*** Power
Here is a list of [[https://en.wikipedia.org/wiki/Laser#Examples_by_power][laser examples by power]]. It is a good way of getting
an idea of what different power ratings mean.

Using a laser more powerful than necessary increases risk of injury
and fire. We need to determine the minimum power required for the
laser diode that can be used to kill the target. According to Kare, "a
few tens of millijoules, delivered within a few milliseconds, will
cause most mosquitoes to expire within 24 hours." This table shows how
long we'll have to keep beams of differing power on the insect to kill
it.

| Desired Energy (mJ) | Diode Power (mW) | Required Time (ms) |
|---------------------+------------------+--------------------|
|                  20 |                5 |        4000.000000 |
|                  20 |               50 |         400.000000 |
|                  20 |              100 |         200.000000 |
|                  20 |              200 |         100.000000 |
|                  20 |             5000 |           4.000000 |
|                  30 |                5 |        6000.000000 |
|                  30 |               50 |         600.000000 |
|                  30 |              100 |         300.000000 |
|                  30 |              200 |         150.000000 |
|                  30 |             5000 |           6.000000 |
#+TBLFM: $3=($1/$2)*1000;%f

High power is required to get tens of mJ on target in single digit
miliseconds, but the turret design may allow us to hit the target
repeatedly in a fairly short time period. I think we should test with
a 50 mW diode as an initial kill laser. 50 mW lasers are easy to find
in the $15-$20 range.

*** Strategy

1. Hit the target with multiple beams that are a fraction of the
   desired kill power. The lasers will intersect at the target
   position, delivering full power.
2. Hit the target with multiple short pulses. This allows us to move
   the beam between pulses, so repeated pulses from each laser will be
   unlikely to deliver much power to the same ground location and
   repeatedly hitting an eye would be highly unlikely.
3. Disable the system if humidity is low to reduce risk of fire.
4. Use a wide diameter beam to increase the chance of damaging a
   target's delicate wings.

*** Testing
We should test with cheap low power (5 mW) lasers with wavelengths in
the visible light band.  These can be purchased for 10 for $10 in
assorted colors, which will help if we are calibrating multiple
turrets.  These are equivalent to the lasers used in standard laser
pointers.

** Candidate Designs
*** Nuke the Entire Site from Orbit

This is the only way to be sure (https://youtu.be/nnHmUk_J6xQ). Note
that this is assumed to be preferrable to nerve gas. However, the
installation has a substantial dollar value attached to it and the
action may not be authorized.

*** Optical Recognition Laser Turret

A candidate design could be a single laser turret. Optical image
recognition might be used for target identification. A mounted laser
would then be aimed and fired. A candidate use case would be
deployment of the turret in a area with moderate to high density of
spotted lanternfly. The turret would be manned and operated in a
semi-autonomous mode. Semi-autonomous deployment would mitigate safety
and weather challenges.

*** Retroreflective Perimeter Fence

This is the solution described in detail in Kare, 2010.
** References

Anonymous. (2020, July 4). "How Does Mosquito Laser Work? Here's How
To Build/Buy A DIY Killer." /PointerClicker/. Retrieved July 4, 2020,
from https://pointerclicker.com/how-mosquito-laser-defense-works/

Kare, J. (2010, Apr 30). "Backyard Star Wars." /IEEE
Spectrum/. Retrieved July 4, 2020, from
https://spectrum.ieee.org/consumer-electronics/gadgets/backyard-star-wars

Myhrvold, N. (Feb 2010). "Could this laser zap malaria?" /TED
Talks/. Retrieved July 4, 2020, from
https://www.ted.com/talks/nathan_myhrvold_could_this_laser_zap_malaria

NIVDIA. (2020 Mar 19). "Getting Started with AI on Jetson Nano"
/NVIDIA Deep Learning Institute/. Retrieved July 5, 2020, from
https://courses.nvidia.com/courses/course-v1:DLI+C-RX-02+V1/info

Schiller, B. (2016, May 3). "What Happened To The Mosquito-Zapping
Laser That Was Going To Stop Malaria?" /Fast Company/. Retrieved July
4, 2020, from
https://www.fastcompany.com/3059127/what-happened-to-the-mosquito-zapping-laser-that-was-going-to-stop-malaria

Wikipedia contributors. (2020, May 16). Mosquito laser. In /Wikipedia,
The Free Encyclopedia/. Retrieved 14:31, July 4, 2020, from
https://en.wikipedia.org/w/index.php?title=Mosquito_laser&oldid=956918485

Wikipedia contributors. (2020, June 22). Spotted lanternfly. In
/Wikipedia, The Free Encyclopedia/. Retrieved 14:43, July 4, 2020,
from
https://en.wikipedia.org/w/index.php?title=Spotted_lanternfly&oldid=963918748

#  LocalWords:  Kare killem Jetson Nano Meccano SparkFun Jetbot SDK
#  LocalWords:  JetPack OpenCV PointerClicker Myhrvold
